> ## Ejemplo practico para pandas con DataFrames

### 1. Inpeccion inicial del DataFrames

In [1]:
# Inportacion de librerias
import pandas as pd

In [2]:
# Crear un dataFrames a partir de un diccionario

data ={
    'Nombre': ['Ana', 'Luis', 'Carlos', 'Lucia', 'Martha', 'Jorge', 'Sofia'],
    'Edad': [23,35,45,25,30,28,32],
    'Ciudad':['CDMX','Guadalajara','Monterey','CDMX', 'puebla','CDMX','Guadalajara'],
    'Salario':[12000,15000,18000,12500,14000,13000,15000],
    'Departamento':['Ventas' ,'Marquetin' ,'ventas', 'TI','TI','Marquetin', 'Ventas']
    }

In [4]:
df = pd.DataFrame(data)
df

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
1    Luis    35  Guadalajara    15000    Marquetin
2  Carlos    45     Monterey    18000       ventas
3   Lucia    25         CDMX    12500           TI
4  Martha    30       puebla    14000           TI
5   Jorge    28         CDMX    13000    Marquetin
6   Sofia    32  Guadalajara    15000       Ventas

### 2. Estutura y Resumen del DataFrame

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Nombre        7 non-null      object
 1   Edad          7 non-null      int64
 2   Ciudad        7 non-null      object
 3   Salario       7 non-null      int64
 4   Departamento  7 non-null      object
dtypes: int64(2), object(3)
memory usage: 408.0+ bytes

In [9]:
df.describe()

            Edad       Salario
count   7.000000      7.000000
mean   31.142857  14214.285714
std     7.335498   2038.323307
min    23.000000  12000.000000
25%    26.500000  12750.000000
50%    30.000000  14000.000000
75%    33.500000  15000.000000
max    45.000000  18000.000000

In [15]:
# Mustra el tama√±o del DataFrame
df.shape

(7, 5)

In [12]:
# numero de filas
df.shape[0]

7

In [13]:
# Numero de columnas

df.shape[1]

5

In [16]:
# Muestar los tipos de datos de las columnas

df.dtypes

Nombre          object
Edad             int64
Ciudad          object
Salario          int64
Departamento    object
dtype: object

In [ ]:
# Muestra el nombre de las Columnas que tengo
df.columns

Index(['Nombre', 'Edad', 'Ciudad', 'Salario', 'Departamento'], dtype='object')

In [19]:
# Muestra los indices
df.index

RangeIndex(start=0, stop=7, step=1)

### 3. Selecion de columnas y filas

In [20]:
# seleciona una sola columna del DataFrame de una serie
df['Edad']

0    23
1    35
2    45
3    25
4    30
5    28
6    32
Name: Edad, dtype: int64

In [21]:
type(df['Edad'])

pandas.core.series.Series

In [22]:
df[['Edad']]

   Edad
0    23
1    35
2    45
3    25
4    30
5    28
6    32

In [23]:
type(df[['Edad']])

pandas.core.frame.DataFrame

In [25]:
df[['Nombre','Salario','Departamento']]

   Nombre  Salario Departamento
0     Ana    12000       Ventas
1    Luis    15000    Marquetin
2  Carlos    18000       ventas
3   Lucia    12500           TI
4  Martha    14000           TI
5   Jorge    13000    Marquetin
6   Sofia    15000       Ventas

### 4. Filtrado de Filas

In [31]:
# Filtrar todas las Filas que sean de CDMX
df['Ciudad'] == 'CDMX'

0     True
1    False
2    False
3     True
4    False
5     True
6    False
Name: Ciudad, dtype: bool

In [32]:

df[df['Ciudad'] == 'CDMX']

  Nombre  Edad Ciudad  Salario Departamento
0    Ana    23   CDMX    12000       Ventas
3  Lucia    25   CDMX    12500           TI
5  Jorge    28   CDMX    13000    Marquetin

In [33]:

df[df['Ciudad'] == 'CDMX'][['Nombre', 'Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [35]:
df_cdmx = df[df['Ciudad'] == 'CDMX']

In [36]:
df_cdmx[['Nombre', 'Ciudad','Salario']]

  Nombre Ciudad  Salario
0    Ana   CDMX    12000
3  Lucia   CDMX    12500
5  Jorge   CDMX    13000

In [ ]:
# Mosrear Todos las filas de las CDMX y Departameto de TI


df[(df['Ciudad'] =='CDMX') & (df['Departamento'] == 'TI')]

  Nombre  Edad Ciudad  Salario Departamento
3  Lucia    25   CDMX    12500           TI

In [ ]:
# Mosrear Todos las filas de la ciudad de  CDMX o del  Departameto de TI
# or = |
df[(df['Ciudad'] =='CDMX') | (df['Departamento'] == 'TI')]

   Nombre  Edad  Ciudad  Salario Departamento
0     Ana    23    CDMX    12000       Ventas
3   Lucia    25    CDMX    12500           TI
4  Martha    30  puebla    14000           TI
5   Jorge    28    CDMX    13000    Marquetin

### Ordenar filas

In [ ]:
df.sort_values(by='Salario')

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marquetin
4  Martha    30       puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marquetin
6   Sofia    32  Guadalajara    15000       Ventas
2  Carlos    45     Monterey    18000       ventas

In [ ]:
df.sort_values(by='Salario',ascending=True)

# Ordena por salarios de Forma acendente (A-Z,0-9)

   Nombre  Edad       Ciudad  Salario Departamento
0     Ana    23         CDMX    12000       Ventas
3   Lucia    25         CDMX    12500           TI
5   Jorge    28         CDMX    13000    Marquetin
4  Martha    30       puebla    14000           TI
1    Luis    35  Guadalajara    15000    Marquetin
6   Sofia    32  Guadalajara    15000       Ventas
2  Carlos    45     Monterey    18000       ventas